### This script contains the following points:

####  Exercise 4.5
####  Task 4.5

# Exercise 4.5

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

In [2]:
# Create a dataframe

df_test = pd.DataFrame()

In [3]:
# Create a mixed type column

df_test['mix'] = ['a', 'b', 1, True]

In [4]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [5]:
# Check for mixed types

for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [6]:
df_test['mix'] = df_test['mix'].astype('str')

In [7]:
# Importing products.csv data

df_prods = pd.read_csv(r'/Users/berk/Instacart_Grocery_Basket_Analysis/02_Data/Original_Data/products.csv', index_col = False)

In [8]:
# Finding Missing Values

df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [9]:
df_nan = df_prods [df_prods ['product_name'].isnull () == True]

In [10]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [ ]:
# Addressing Missing Values
There are a few ways to deal with missing data:

1.Create a new variable that acts like a flag based on the missing value.
2.Impute the value with the mean or median of the column (if the variable is numeric).
3.Remove or filter out the missing data.

If you choose to use the mean, you can use the # df.describe()#
then use the following code to replace your missing values with it:

###  df['column with missings'].fillna(mean value, inplace=True)

In [ ]:
If you choose to use the median, you can find it using the df_prods.median()

### df['column with missings'].fillna(median value, inplace=True)

In [13]:
# Before making this new dataframe

df_prods.shape

(49693, 5)

In [14]:
# Next, create a new dataframe

df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [15]:
df_prods_clean.shape

(49677, 5)

In [16]:
# Another way you can drop all missing values is via the following command

df_prods.dropna(subset = ['product_name'], inplace = True)

In [17]:
# Finding Duplicates

df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [18]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [19]:
# Addressing Duplicates

df_prods_clean.shape

(49677, 5)

In [20]:
# create a new dataframe that doesn’t include the duplicates

df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [21]:
df_prods_clean_no_dups.shape

(49672, 5)

# Task 4.5

In [ ]:
#1. Data Consistency Checks df_prods dataframe

In [22]:
df_prods.describe()

         product_id      aisle_id  department_id        prices
count  49677.000000  49677.000000   49677.000000  49677.000000
mean   24850.194235     67.763110      11.728687      9.993164
std    14340.588602     38.316396       5.850651    453.592708
min        1.000000      1.000000       1.000000      1.000000
25%    12433.000000     35.000000       7.000000      4.100000
50%    24851.000000     69.000000      13.000000      7.100000
75%    37267.000000    100.000000      17.000000     11.100000
max    49688.000000    134.000000      21.000000  99999.000000

In [ ]:
#2. Share in a markdown cell whether anything about the data looks off or should be investigated further.

The max value for 'prices' is 99999. This could be an error or a placeholder for missing values.

In [23]:
df_prods[df_prods.prices == 99999]

       product_id           product_name  aisle_id  department_id   prices
33666       33664  2 % Reduced Fat  Milk        84             16  99999.0

In [ ]:
#3. Check for mixed-type data in your df_ords dataframe.

In [24]:
df_ords = pd.read_csv(r'/Users/berk/Instacart_Grocery_Basket_Analysis/02_Data/Original_Data/orders.csv', index_col = False)

In [25]:
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
        print (col, ' mixed')
  else: print(col, ' consistent')

order_id  consistent
user_id  consistent
eval_set  consistent
order_number  consistent
order_dow  consistent
order_hour_of_day  consistent
days_since_prior_order  consistent

In [ ]:
#5. Run a check for missing values in your df_ords dataframe.

In [26]:
df_ords.isnull().sum()

order_id                       0
user_id                        0
eval_set                       0
order_number                   0
order_dow                      0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [27]:
# create a dataframe for the missing values
df_ords_nan = df_ords [df_ords ['days_since_prior_order'].isnull () == True]

In [28]:
df_ords_nan

,order_id,user_id,eval_set,order_number,order_dow,order_hour_of_day,days_since_prior_order
0,2539329,1,prior,1,2,8,NaN
11,2168274,2,prior,1,2,11,NaN
26,1374495,3,prior,1,1,14,NaN
39,3343014,4,prior,1,6,11,NaN
45,2717275,5,prior,1,3,12,NaN
...,...,...,...,...,...,...,...
3420930,969311,206205,prior,1,4,12,NaN
3420934,3189322,206206,prior,1,3,18,NaN
3421002,2166133,206207,prior,1,6,19,NaN
3421019,2227043,206208,prior,1,1,15,NaN
3421069,3154581,206209,prior,1,3,11,NaN

The missing value might be because the bulk of the customer are first timer that have never place an order before. It might be ideal to create another column of boolean data type to distinguish between new and old(returning) customers

In [ ]:
#6. Address the missing values using an appropriate method.

In [29]:
df_ords.shape

(3421083, 7)

In [30]:
df_ords_clean = df_ords[df_ords['days_since_prior_order'].isnull() == False]

In [31]:
df_ords_clean.shape

(3214874, 7)

In [32]:
df_ords.dropna(subset = ['days_since_prior_order'], inplace = True)

In [ ]:
#7. Run a check for duplicate values in your df_ords data.

In [33]:
df_ords_dups = df_ords[df_ords.duplicated()]

In [34]:
df_ords_dups.size

0

In [ ]:
#8. Export your final, cleaned df_prods and df_ords data as “.csv” files in your “Prepared Data”

In [35]:
path = r'/Users/berk/Instacart_Grocery_Basket_Analysis'

In [36]:
df_ords_dups.to_csv(os.path.join(path, '02_Data','Prepared_Data', 'order_cleaned.csv'))

In [37]:
df_prods_clean_no_dups.to_csv(os.path.join(path, '02_Data','Prepared_Data', 'products_cleaned.csv'))